In [1]:
import numpy  as np
import pandas as pd

import warnings
warnings.filterwarnings(action='ignore')

from datetime import date, datetime, timedelta
from dateutil.parser import parse

import json
import urllib

# titanic dataset
import seaborn as sns

# 비정형 데이터 처리를 위한 라이브러리
from bs4 import BeautifulSoup
import requests
import re



print('numpy  version - ' , np.__version__)
print('pandas version - ' , pd.__version__)

numpy  version -  1.20.3
pandas version -  1.3.4

In [2]:
def seriesInfo(s) :
    print('series : index + values \n' , s)
    print('index  - ' , s.index  , type(s.index))
    print('values - ' , s.values , type(s.values))

def frmInfo(df) :
    display('data - ' , df )
    print()
    print('shape   - ' , df.shape , df.shape[0] , df.shape[1])
    print('size    - ' , df.size )
    print('ndim    - ' , df.ndim)
    print('index   - ' , df.index    , type(df.index))
    print('columns - ' , df.columns  , type( df.columns ))
    print('values  - \n' , df.values , type(df.values) )

In [3]:
data01 = {
    '학번' : [100, 200, 300, 400],
    '이름' : ['Jason', 'Kiki', 'Rosa', 'Nick'],
    '학년' : [2, 4, 3, 1]
}

data02 = {
    '학번' : [100, 200, 400, 500],
    '학과' : ['CS', 'AI', 'AI', 'CS'],
    '학점' : [2.4, 4.5, 1.7, 3.9]
}
stu_frm   = pd.DataFrame(data01)
major_frm = pd.DataFrame(data02)

display(stu_frm)
print()
display(major_frm)

    학번     이름  학년
0  100  Jason   2
1  200   Kiki   4
2  300   Rosa   3
3  400   Nick   1

    학번  학과   학점
0  100  CS  2.4
1  200  AI  4.5
2  400  AI  1.7
3  500  CS  3.9

In [4]:
print('how = inner , outer , left , right - ')
pd.merge(stu_frm , major_frm , how = 'right')

how = inner , outer , left , right -

    학번     이름   학년  학과   학점
0  100  Jason  2.0  CS  2.4
1  200   Kiki  4.0  AI  4.5
2  400   Nick  1.0  AI  1.7
3  500    NaN  NaN  CS  3.9

In [5]:
data01 = {
    '학번' : [100, 200, 300, 400],
    '이름' : ['Jason', 'Kiki', 'Rosa', 'Matthew'],
    '학년' : [2, 4, 3, 1]
}

data02 = {
    '과목코드' : [100, 200, 400, 500],
    '학과' : ['CS', 'AI', 'AI', 'CS'],
    '학점' : [2.4, 4.5, 1.7, 3.9]
}
stu_frm   = pd.DataFrame(data01)
major_frm = pd.DataFrame(data02)

display(stu_frm)
print()
display(major_frm)

    학번       이름  학년
0  100    Jason   2
1  200     Kiki   4
2  300     Rosa   3
3  400  Matthew   1

   과목코드  학과   학점
0   100  CS  2.4
1   200  AI  4.5
2   400  AI  1.7
3   500  CS  3.9

In [6]:
pd.merge(stu_frm , major_frm , how = 'inner' , left_on = '학번' , right_on = '과목코드')

    학번       이름  학년  과목코드  학과   학점
0  100    Jason   2   100  CS  2.4
1  200     Kiki   4   200  AI  4.5
2  400  Matthew   1   400  AI  1.7

In [7]:
datasets = sns.load_dataset('iris')
print('type - ' , type(datasets))
print()

type -  <class 'pandas.core.frame.DataFrame'>

In [8]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [9]:
datasets.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [10]:
data01 = {
    'species'      : ['setosa' , 'virginica' ,  'virginica'  , 'versicolor'],
    'sepal_length' : [5.1, 4.9 , 3.7 , 1.5] ,
    'petal_width'  : [4.1, 3.9, 3.7, 3.6]
}

data02 = {
    'species'      : ['setosa' , 'setosa' , 'virginica' ,  'virginica'],
    'sepal_length' : [4.1, 5.9 , 4.7 , 3.5]
}

iris01_frm   = pd.DataFrame(data01)
iris02_frm = pd.DataFrame(data02)

display(iris01_frm)
print()
display(iris02_frm)

      species  sepal_length  petal_width
0      setosa           5.1          4.1
1   virginica           4.9          3.9
2   virginica           3.7          3.7
3  versicolor           1.5          3.6

     species  sepal_length
0     setosa           4.1
1     setosa           5.9
2  virginica           4.7
3  virginica           3.5

In [11]:
print('on -> 중복되는 키가 존재할 경우 어느 키를 기준으로 merge할지를 결정 - ')
pd.merge(iris01_frm , iris02_frm , on = 'species')

on -> 중복되는 키가 존재할 경우 어느 키를 기준으로 merge할지를 결정 -

     species  sepal_length_x  petal_width  sepal_length_y
0     setosa             5.1          4.1             4.1
1     setosa             5.1          4.1             5.9
2  virginica             4.9          3.9             4.7
3  virginica             4.9          3.9             3.5
4  virginica             3.7          3.7             4.7
5  virginica             3.7          3.7             3.5

In [13]:
print('인덱스를 기준으로 병합 - ')
print('left_index , right_index - ')

pop01_frm = pd.DataFrame({
    'city' : ['seoul' , 'seoul' , 'seoul' , 'kwangju' , 'kwangju'],
    'year' : [2010 , 2050, 2020, 2018 , 2022],
    'pop'  : [1234567, 2345678, 3456789, 4567890, 5678901]
})

pop02_frm = pd.DataFrame( np.arange(12).reshape(6,2) ,
                          columns = ['col01' , 'col02'] ,
                          index   = [ ['seoul' , 'seoul' , 'kwangju' ,  'kwangju' ,  'kwangju',  'kwangju'] ,
                                      [2010 , 2050, 2020, 2018 , 2022, 2024]
                                    ] )

print()
display(pop01_frm)
print()
display(pop02_frm)

인덱스를 기준으로 병합 -
left_index , right_index -

      city  year      pop
0    seoul  2010  1234567
1    seoul  2050  2345678
2    seoul  2020  3456789
3  kwangju  2018  4567890
4  kwangju  2022  5678901

              col01  col02
seoul   2010      0      1
        2050      2      3
kwangju 2020      4      5
        2018      6      7
        2022      8      9
        2024     10     11

In [14]:
pd.merge(pop01_frm , pop02_frm , right_index = True , left_on=['city' , 'year'])

      city  year      pop  col01  col02
0    seoul  2010  1234567      0      1
1    seoul  2050  2345678      2      3
3  kwangju  2018  4567890      6      7
4  kwangju  2022  5678901      8      9

In [16]:
print('인덱스를 기준으로 병합 - ')
print('left_index , right_index - ')

pop01_frm = pd.DataFrame({
    'city' : ['seoul' , 'seoul' , 'seoul' , 'kwangju' , 'kwangju'],
    'year' : [2010 , 2050, 2020, 2018 , 2022],
    'pop'  : [1234567, 2345678, 3456789, 4567890, 5678901]
    } ,
    index = [1,3,5,7,9])
pop02_frm = pd.DataFrame( np.arange(12).reshape(6,2) ,
                          columns = ['col01' , 'col02'] ,
                          index   = [1,2,3,4,5,6] )

print()
display(pop01_frm)
print()
display(pop02_frm)

인덱스를 기준으로 병합 -
left_index , right_index -

      city  year      pop
1    seoul  2010  1234567
3    seoul  2050  2345678
5    seoul  2020  3456789
7  kwangju  2018  4567890
9  kwangju  2022  5678901

   col01  col02
1      0      1
2      2      3
3      4      5
4      6      7
5      8      9
6     10     11

In [17]:
pd.merge(pop01_frm , pop02_frm , right_index = True , left_index = True )

    city  year      pop  col01  col02
1  seoul  2010  1234567      0      1
3  seoul  2050  2345678      4      5
5  seoul  2020  3456789      8      9

In [18]:
pop01_frm.join(pop02_frm , how = 'inner')

    city  year      pop  col01  col02
1  seoul  2010  1234567      0      1
3  seoul  2050  2345678      4      5
5  seoul  2020  3456789      8      9

In [19]:
s01 = pd.Series([0,1]   , index=['a', 'b'])
s02 = pd.Series([2,3,4] , index=['c', 'd' , 'e'])

s03 = pd.concat([s01, s02] , ignore_index = True)
s03.index.values

array([0, 1, 2, 3, 4])

In [20]:
concat01_frm = pd.DataFrame( np.arange(6).reshape(3,2)  ,
                             index = ['a', 'b', 'c'] ,
                             columns = ['col01' , 'col02'])
display(concat01_frm)

   col01  col02
a      0      1
b      2      3
c      4      5

In [21]:
concat02_frm = pd.DataFrame( np.arange(4).reshape(2,2)  ,
                             index = ['a', 'c'] ,
                             columns = ['col03' , 'col04'])
display(concat02_frm)

   col03  col04
a      0      1
c      2      3

In [22]:
print('axis = 1 (열) , axis = 0 (행)')
pd.concat([concat01_frm, concat02_frm] , axis = 1)

axis = 1 (열) , axis = 0 (행)

   col01  col02  col03  col04
a      0      1    0.0    1.0
b      2      3    NaN    NaN
c      4      5    2.0    3.0

In [23]:
stock01_frm = pd.read_excel('/Users/choijaewoo/pandas_data/stock price.xlsx')

In [24]:
stock02_frm = pd.read_excel('/Users/choijaewoo/pandas_data/stock valuation.xlsx')

In [25]:
display(stock01_frm)
display(stock02_frm)

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475

       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [26]:
print('case 01 - merge : 교집합, 합집합, 왼쪽프레임 기준, 오른쪽프레임 기준 , 키 값 분리 - ')
print('case 02 - join : index_col = id 지정하여 로드하는 방식' )
print('case 03 - concat ' )

case 01 - merge : 교집합, 합집합, 왼쪽프레임 기준, 오른쪽프레임 기준 , 키 값 분리 -
case 02 - join : index_col = id 지정하여 로드하는 방식
case 03 - concat

In [27]:
print('case 01 - 교집합')
merge_inner_frm = pd.merge(stock01_frm , stock02_frm , how = 'inner')
display( merge_inner_frm )

print('case 01 - 합집합')
merge_outer_frm = pd.merge(stock01_frm , stock02_frm , how = 'outer' , on = 'id')
display( merge_outer_frm )

case 01 - 교집합

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

case 01 - 합집합

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000.0,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200.0,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200.0,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500.0,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400.0,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359
10,136480,NaN,NaN,NaN,하림,274.166667,3551.0,11.489362,0.887074
11,138040,NaN,NaN,NaN,메리츠금융지주,2122.333333,14894.0,6.313806,0.899691
12,161390,NaN,NaN,NaN,한국타이어,5648.500000,51341.0,7.453306,0.820007
13,181710,NaN,NaN,NaN,NHN엔터테인먼트,2110.166667,78434.0,30.755864,0.827447
14,207940,NaN,NaN,NaN,삼성바이오로직스,4644.166667,60099.0,89.790059,6.938551

In [28]:
print('case 01 - 왼쪽프레임 기준')
merge_left_frm = pd.merge(stock01_frm , stock02_frm , how = 'left' , left_on='stock_name' , right_on = 'name')
display( merge_left_frm )

print('case 01 - 오른쪽프레임 기준')
merge_right_frm = pd.merge(stock01_frm , stock02_frm , how = 'right' , left_on='stock_name' , right_on = 'name')
display( merge_right_frm )

case 01 - 왼쪽프레임 기준

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,130960.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500,139480.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000,145990.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500,185750.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475,204210.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359

case 01 - 오른쪽프레임 기준

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,130960.0,CJ E&M,58540.666667,98900.0,130960,CJ E&M,6301.333333,54068,15.695091,1.829178
1,NaN,NaN,NaN,NaN,136480,하림,274.166667,3551,11.489362,0.887074
2,NaN,NaN,NaN,NaN,138040,메리츠금융지주,2122.333333,14894,6.313806,0.899691
3,139480.0,이마트,239230.833333,254500.0,139480,이마트,18268.166667,295780,13.931338,0.860437
4,145990.0,삼양사,82750.000000,82000.0,145990,삼양사,5741.000000,108090,14.283226,0.758627
5,NaN,NaN,NaN,NaN,161390,한국타이어,5648.500000,51341,7.453306,0.820007
6,NaN,NaN,NaN,NaN,181710,NHN엔터테인먼트,2110.166667,78434,30.755864,0.827447
7,185750.0,종근당,40293.666667,100500.0,185750,종근당,3990.333333,40684,25.185866,2.470259
8,204210.0,모두투어리츠,3093.333333,3475.0,204210,모두투어리츠,85.166667,5335,40.802348,0.651359
9,NaN,NaN,NaN,NaN,207940,삼성바이오로직스,4644.166667,60099,89.790059,6.938551